ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/USART/hal_uart_lld.c
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    USART/hal_uart_lld.c
 * @brief   STM32 low level UART driver code.
 *
 * @addtogroup UART
 * @{
 */

#include "hal.h"

#if HAL_USE_UART || defined(__DOXYGEN__)

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

#define USART1_RX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART1_RX_DMA_STREAM,                     \
                       GD32_USART1_RX_DMA_CHN)

#define USART1_TX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART1_TX_DMA_STREAM,                     \
                       GD32_USART1_TX_DMA_CHN)

#define USART2_RX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART2_RX_DMA_STREAM,                     \
                       GD32_USART2_RX_DMA_CHN)

#define USART2_TX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART2_TX_DMA_STREAM,                     \
                       GD32_USART2_TX_DMA_CHN)

#define USART3_RX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART3_RX_DMA_STREAM,                     \
                       GD32_USART3_RX_DMA_CHN)

#define USART3_TX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART3_TX_DMA_STREAM,                     \
                       GD32_USART3_TX_DMA_CHN)

#define UART4_RX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART4_RX_DMA_STREAM,                      \
                       GD32_UART4_RX_DMA_CHN)

#define UART4_TX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART4_TX_DMA_STREAM,                      \
                       GD32_UART4_TX_DMA_CHN)

#define UART5_RX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART5_RX_DMA_STREAM,                      \
                       GD32_UART5_RX_DMA_CHN)

#define UART5_TX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART5_TX_DMA_STREAM,                      \
                       GD32_UART5_TX_DMA_CHN)

#define USART6_RX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART6_RX_DMA_STREAM,                     \
                       GD32_USART6_RX_DMA_CHN)

#define USART6_TX_DMA_CHANNEL                                               \
  GD32_DMA_GETCHANNEL(GD32_UART_USART6_TX_DMA_STREAM,                     \
                       GD32_USART6_TX_DMA_CHN)

#define UART7_RX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART7_RX_DMA_STREAM,                      \
                       GD32_UART7_RX_DMA_CHN)

#define UART7_TX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART7_TX_DMA_STREAM,                      \
                       GD32_UART7_TX_DMA_CHN)

#define UART8_RX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART8_RX_DMA_STREAM,                      \
                       GD32_UART8_RX_DMA_CHN)

#define UART8_TX_DMA_CHANNEL                                                \
  GD32_DMA_GETCHANNEL(GD32_UART_UART8_TX_DMA_STREAM,                      \
                       GD32_UART8_TX_DMA_CHN)

#define GD32_UART45_CR2_CHECK_MASK                                         \
  (USART_CTL1_STB_0 | USART_CTL1_CKEN | USART_CTL1_CPL | USART_CTL1_CPH |   \
   USART_CTL1_CLEN)

#define GD32_UART45_CR3_CHECK_MASK                                         \
  (USART_CTL2_CTSIE | USART_CTL2_CTSEN | USART_CTL2_RTSEN | USART_CTL2_SCEN |     \
   USART_CTL2_NKEN)

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/** @brief USART1 UART driver identifier.*/
#if GD32_UART_USE_USART1 || defined(__DOXYGEN__)
UARTDriver UARTD1;
#endif

/** @brief USART2 UART driver identifier.*/
#if GD32_UART_USE_USART2 || defined(__DOXYGEN__)
UARTDriver UARTD2;
#endif

/** @brief USART3 UART driver identifier.*/
#if GD32_UART_USE_USART3 || defined(__DOXYGEN__)
UARTDriver UARTD3;
#endif

/** @brief UART4 UART driver identifier.*/
#if GD32_UART_USE_UART4 || defined(__DOXYGEN__)
UARTDriver UARTD4;
#endif

/** @brief UART5 UART driver identifier.*/
#if GD32_UART_USE_UART5 || defined(__DOXYGEN__)
UARTDriver UARTD5;
#endif

/** @brief USART6 UART driver identifier.*/
#if GD32_UART_USE_USART6 || defined(__DOXYGEN__)
UARTDriver UARTD6;
#endif

/** @brief UART7 UART driver identifier.*/
#if GD32_UART_USE_UART7 || defined(__DOXYGEN__)
UARTDriver UARTD7;
#endif

/** @brief UART8 UART driver identifier.*/
#if GD32_UART_USE_UART8 || defined(__DOXYGEN__)
UARTDriver UARTD8;
#endif

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

/**
 * @brief   Status bits translation.
 *
 * @param[in] stat        USART STAT register value
 *
 * @return  The error flags.
 */
static uartflags_t translate_errors(uint16_t stat) {
  uartflags_t sts = 0;

  if (stat & USART_STAT_ORERR)
    sts |= UART_OVERRUN_ERROR;
  if (stat & USART_STAT_PERR)
    sts |= UART_PARITY_ERROR;
  if (stat & USART_STAT_FERR)
    sts |= UART_FRAMING_ERROR;
  if (stat & USART_STAT_NERR)
    sts |= UART_NOISE_ERROR;
  if (stat & USART_STAT_LBDF)
    sts |= UART_BREAK_DETECTED;
  return sts;
}

/**
 * @brief   Puts the receiver in the UART_RX_IDLE state.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 */
static void uart_enter_rx_idle_loop(UARTDriver *uartp) {
  uint32_t mode;

  /* RX DMA channel preparation, if the char callback is defined then the
     TCIE interrupt is enabled too.*/
  if (uartp->config->rxchar_cb == NULL)
    mode = GD32_DMA_CTL_DIR_P2M | GD32_DMA_CTL_CMEN;
  else
    mode = GD32_DMA_CTL_DIR_P2M | GD32_DMA_CTL_CMEN | GD32_DMA_CTL_FTFIE;
  dmaStreamSetMemory0(uartp->dmarx, &uartp->rxbuf);
  dmaStreamSetTransactionSize(uartp->dmarx, 1);
  dmaStreamSetMode(uartp->dmarx, uartp->dmarxmode | mode);
  dmaStreamEnable(uartp->dmarx);
}

/**
 * @brief   USART de-initialization.
 * @details This function must be invoked with interrupts disabled.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 */
static void usart_stop(UARTDriver *uartp) {

  /* Stops RX and TX DMA channels.*/
  dmaStreamDisable(uartp->dmarx);
  dmaStreamDisable(uartp->dmatx);

  /* Stops USART operations.*/
  uartp->usart->CTL0 = 0;
  uartp->usart->CTL1 = 0;
  uartp->usart->CTL2 = 0;
}

/**
 * @brief   USART initialization.
 * @details This function must be invoked with interrupts disabled.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 */
static void usart_start(UARTDriver *uartp) {
  uint32_t fck;
  uint16_t ctl0;
  USART_TypeDef *u = uartp->usart;

  /* Defensive programming, starting from a clean state.*/
  usart_stop(uartp);

