ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/USART/hal_uart_lld.c
      osalDbgAssert((uartp->config->ctl1 & GD32_UART45_CR2_CHECK_MASK) == 0,
                    "specified invalid bits in UART4 CR2 register settings");
      osalDbgAssert((uartp->config->ctl2 & GD32_UART45_CR3_CHECK_MASK) == 0,
                    "specified invalid bits in UART4 CR3 register settings");

      uartp->dmarx = dmaStreamAllocI(GD32_UART_UART4_RX_DMA_STREAM,
                                     GD32_UART_UART4_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_rx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmarx != NULL, "unable to allocate stream");
      uartp->dmatx = dmaStreamAllocI(GD32_UART_UART4_TX_DMA_STREAM,
                                     GD32_UART_UART4_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_tx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmatx != NULL, "unable to allocate stream");

      rccEnableUART4(true);
      eclicEnableVector(GD32_UART4_NUMBER, GD32_UART_UART4_IRQ_PRIORITY, GD32_UART_UART4_IRQ_TRIGGER);
      uartp->dmarxmode |= GD32_DMA_CTL_CHSEL(UART4_RX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART4_DMA_PRIORITY);
      uartp->dmatxmode |= GD32_DMA_CTL_CHSEL(UART4_TX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART4_DMA_PRIORITY);
    }
#endif

#if GD32_UART_USE_UART5
    if (&UARTD5 == uartp) {

      osalDbgAssert((uartp->config->ctl1 & GD32_UART45_CR2_CHECK_MASK) == 0,
                    "specified invalid bits in UART5 CR2 register settings");
      osalDbgAssert((uartp->config->ctl2 & GD32_UART45_CR3_CHECK_MASK) == 0,
                    "specified invalid bits in UART5 CR3 register settings");

      uartp->dmarx = dmaStreamAllocI(GD32_UART_UART5_RX_DMA_STREAM,
                                     GD32_UART_UART5_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_rx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmarx != NULL, "unable to allocate stream");
      uartp->dmatx = dmaStreamAllocI(GD32_UART_UART5_TX_DMA_STREAM,
                                     GD32_UART_UART5_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_tx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmatx != NULL, "unable to allocate stream");

      rccEnableUART5(true);
      eclicEnableVector(GD32_UART5_NUMBER, GD32_UART_UART5_IRQ_PRIORITY, GD32_UART_UART5_IRQ_TRIGGER);
      uartp->dmarxmode |= GD32_DMA_CTL_CHSEL(UART5_RX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART5_DMA_PRIORITY);
      uartp->dmatxmode |= GD32_DMA_CTL_CHSEL(UART5_TX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART5_DMA_PRIORITY);
    }
#endif

#if GD32_UART_USE_USART6
    if (&UARTD6 == uartp) {
      uartp->dmarx = dmaStreamAllocI(GD32_UART_USART6_RX_DMA_STREAM,
                                     GD32_UART_USART6_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_rx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmarx != NULL, "unable to allocate stream");
      uartp->dmatx = dmaStreamAllocI(GD32_UART_USART6_TX_DMA_STREAM,
                                     GD32_UART_USART6_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_tx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmatx != NULL, "unable to allocate stream");

      rccEnableUSART6(true);
      eclicEnableVector(GD32_USART6_NUMBER, GD32_UART_USART6_IRQ_PRIORITY, GD32_UART_USART6_IRQ_TRIGGER);
      uartp->dmarxmode |= GD32_DMA_CTL_CHSEL(USART6_RX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_USART6_DMA_PRIORITY);
      uartp->dmatxmode |= GD32_DMA_CTL_CHSEL(USART6_TX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_USART6_DMA_PRIORITY);
    }
#endif

#if GD32_UART_USE_UART7
    if (&UARTD7 == uartp) {

      osalDbgAssert((uartp->config->ctl1 & GD32_UART45_CR2_CHECK_MASK) == 0,
                    "specified invalid bits in UART7 CR2 register settings");
      osalDbgAssert((uartp->config->ctl2 & GD32_UART45_CR3_CHECK_MASK) == 0,
                    "specified invalid bits in UART7 CR3 register settings");

      uartp->dmarx = dmaStreamAllocI(GD32_UART_UART7_RX_DMA_STREAM,
                                     GD32_UART_UART7_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_rx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmarx != NULL, "unable to allocate stream");
      uartp->dmatx = dmaStreamAllocI(GD32_UART_UART7_TX_DMA_STREAM,
                                     GD32_UART_UART7_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_tx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmatx != NULL, "unable to allocate stream");

      rccEnableUART7(true);
      eclicEnableVector(GD32_UART7_NUMBER, GD32_UART_UART7_IRQ_PRIORITY, GD32_UART_UART7_IRQ_TRIGGER);
      uartp->dmarxmode |= GD32_DMA_CTL_CHSEL(UART7_RX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART7_DMA_PRIORITY);
      uartp->dmatxmode |= GD32_DMA_CTL_CHSEL(UART7_TX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART7_DMA_PRIORITY);
    }
#endif

#if GD32_UART_USE_UART8
    if (&UARTD8 == uartp) {

      osalDbgAssert((uartp->config->ctl1 & GD32_UART45_CR2_CHECK_MASK) == 0,
                    "specified invalid bits in UART8 CR2 register settings");
      osalDbgAssert((uartp->config->ctl2 & GD32_UART45_CR3_CHECK_MASK) == 0,
                    "specified invalid bits in UART8 CR3 register settings");

      uartp->dmarx = dmaStreamAllocI(GD32_UART_UART8_RX_DMA_STREAM,
                                     GD32_UART_UART8_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_rx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmarx != NULL, "unable to allocate stream");
      uartp->dmatx = dmaStreamAllocI(GD32_UART_UART8_TX_DMA_STREAM,
                                     GD32_UART_UART8_IRQ_PRIORITY,
                                     (gd32_dmaisr_t)uart_lld_serve_tx_end_irq,
                                     (void *)uartp);
      osalDbgAssert(uartp->dmatx != NULL, "unable to allocate stream");

      rccEnableUART8(true);
      eclicEnableVector(GD32_UART8_NUMBER, GD32_UART_UART8_IRQ_PRIORITY, GD32_UART_UART8_IRQ_TRIGGER);
      uartp->dmarxmode |= GD32_DMA_CTL_CHSEL(UART8_RX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART8_DMA_PRIORITY);
      uartp->dmatxmode |= GD32_DMA_CTL_CHSEL(UART8_TX_DMA_CHANNEL) |
                          GD32_DMA_CTL_PRIO(GD32_UART_UART8_DMA_PRIORITY);
    }
#endif

    /* Static DMA setup, the transfer size depends on the USART settings,
       it is 16 bits if M=1 and PCE=0 else it is 8 bits.*/
    if ((uartp->config->ctl0 & (USART_CTL0_WL | USART_CTL0_PCEN)) == USART_CTL0_WL) {
      uartp->dmarxmode |= GD32_DMA_CTL_PWIDTH_HWORD | GD32_DMA_CTL_MWIDTH_HWORD;
      uartp->dmatxmode |= GD32_DMA_CTL_PWIDTH_HWORD | GD32_DMA_CTL_MWIDTH_HWORD;
    }
    dmaStreamSetPeripheral(uartp->dmarx, &uartp->usart->DATA);
    dmaStreamSetPeripheral(uartp->dmatx, &uartp->usart->DATA);
    uartp->rxbuf = 0;
  }

  uartp->rxstate = UART_RX_IDLE;
  uartp->txstate = UART_TX_IDLE;
  usart_start(uartp);
}

/**
 * @brief   Deactivates the UART peripheral.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 *
 * @notapi
 */
void uart_lld_stop(UARTDriver *uartp) {

